#!/usr/bin/env python
# -*- coding: utf-8 -*-

ASSET_INSERT = {
    '表7': [
        '[_资产名称_]', [
            ('实收资本（或股本）',),
            ('　减：已归还投资',),
            ('实收资本净额（或股本）',),
            ('资本公积',),
            ('　其中：库存股',),
            ('盈余公积',),
            ('　其中：法定公益金',),
            ('未分配利润（未弥补亏损以“-”号表示）',),
            ('所有者权益（净资产）合计',)
        ]
    ],
    '表8': [
        '[_科目名称_]', [
            ('一、应收坏账准备合计',),
            ('　　其中：应收票据',),
            ('　　　　　应收账款',),
            ('　　　　　预付账款',),
            ('　　　　　其他应收款',),
            ('二、存货跌价准备',),
            ('三、可供出售金融资产减值准备合计',),
            ('　　其中：可供出售股票',),
            ('　　　　　可供出售债券',),
            ('　　　　　可供出售其他资产',),
            ('四、持有至到期投资减值准备',),
            ('五、长期应收款减值准备',),
            ('六、长期股权投资减值准备',),
            ('七、投资性房地产减值准备合计',),
            ('　　其中：房屋',),
            ('　　　　　土地使用权',),
            ('八、固定资产减值准备合计',),
            ('　　其中：房屋、建筑物',),
            ('　　　　　构筑物及其他辅助设施',),
            ('　　　　　管道和沟槽',),
            ('　　　　　机器设备',),
            ('　　　　　车辆',),
            ('　　　　　电子设备',),
            ('九、在建工程减值准备合计',),
            ('　　其中：在建土建工程',),
            ('　　　　　在建设备安装',),
            ('十、工程物质减值准备',),
            ('十一、生产性生物资产减值准备',),
            ('十二、油气资产减值准备',),
            ('十三、无形资产减值准备',),
            ('十四、商誉减值准备',),
            ('资产减值合计',)
        ]
    ],
    '公式': [
        '[表名], [强制], [等式]', [
            ('表3-1-1', False, '_账面价值_=_外币账面金额_*_评估基准日汇率_'),
            ('表3-1-1', False, '评估价值_=_账面价值_'),
            ('表3-1-1', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-1-1', True, '增值率_=增减值_/_账面价值_'),

            ('表3-1-2', False, '_账面价值_=_外币账面金额_*_评估基准日汇率_'),
            ('表3-1-2', False, '评估价值_=_账面价值_'),
            ('表3-1-2', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-1-2', True, '增值率_=增减值_/_账面价值_'),

            ('表3-1-3', False, '_账面价值_=_外币账面金额_*_评估基准日汇率_'),
            ('表3-1-3', False, '评估价值_=_账面价值_'),
            ('表3-1-3', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-1-3', True, '增值率_=增减值_/_账面价值_'),

            ('表3-2-1', False, '_账面价值_=_成本_'),
            ('表3-2-1', False, '评估价值_=_持股数量_*基准日收盘价/股_'),
            ('表3-2-1', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-2-1', True, '增值率_=增减值_/_账面价值_'),

            ('表3-2-2', False, '_账面价值_=_成本_'),
            ('表3-2-2', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-2-2', True, '增值率_=增减值_/_账面价值_'),

            ('表3-2-3', False, '_账面价值_=_成本_'),
            ('表3-2-3', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-2-3', True, '增值率_=增减值_/_账面价值_'),

            ('表3-3', False, '评估价值_=_账面价值_'),
            ('表3-3', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-3', True, '增值率_=增减值_/_账面价值_'),

            ('表3-4', True, '_账龄_=self.aging("_发生日期_")'),
            ('表3-4', False, '评估价值_=_账面价值_'),
            ('表3-4', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-4', True, '增值率_=增减值_/_账面价值_'),

            ('表3-5', True, '_账龄_=self.aging("_发生日期_")'),
            ('表3-5', False, '评估价值_=_账面价值_'),
            ('表3-5', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-5', True, '增值率_=增减值_/_账面价值_'),

            ('表3-6', False, '评估价值_=_账面价值_'),
            ('表3-6', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-6', True, '增值率_=增减值_/_账面价值_'),

            ('表3-7', False, '评估价值_=_账面价值_'),
            ('表3-7', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-7', True, '增值率_=增减值_/_账面价值_'),

            ('表3-8', True, '_账龄_=self.aging("_发生日期_")'),
            ('表3-8', False, '评估价值_=_账面价值_'),
            ('表3-8', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-8', True, '增值率_=增减值_/_账面价值_'),

            ('表3-9-1', False, '评估数量_=_账面数量_'),
            ('表3-9-1', False, '评估单价_=_账面单价_'),
            ('表3-9-1', False, '_账面金额_=_账面数量_*_账面单价_'),
            ('表3-9-1', False, '评估金额_=评估数量_*评估单价_'),
            ('表3-9-1', True, '增减值_=评估金额_-_账面金额_'),
            ('表3-9-1', True, '增值率_=增减值_/_账面金额_'),

            ('表3-9-2', False, '实际数量_=_账面数量_'),
            ('表3-9-2', False, '评估单价_=_账面单价_'),
            ('表3-9-2', False, '_账面金额_=_账面数量_*_账面单价_'),
            ('表3-9-2', False, '评估金额_=实际数量_*评估单价_'),
            ('表3-9-2', True, '增减值_=评估金额_-_账面金额_'),
            ('表3-9-2', True, '增值率_=增减值_/_账面金额_'),

            ('表3-9-3', False, '实际数量_=_账面数量_'),
            ('表3-9-3', False, '评估单价_=_账面单价_'),
            ('表3-9-3', False, '_账面金额_=_账面数量_*_账面单价_'),
            ('表3-9-3', False, '评估金额_=实际数量_*评估单价_'),
            ('表3-9-3', True, '增减值_=评估金额_-_账面金额_'),
            ('表3-9-3', True, '增值率_=增减值_/_账面金额_'),

            ('表3-9-4', False, '实际数量_=_账面数量_'),
            ('表3-9-4', False, '评估单价_=_账面单价_'),
            ('表3-9-4', False, '_账面金额_=_账面数量_*_账面单价_'),
            ('表3-9-4', False, '评估金额_=实际数量_*评估单价_'),
            ('表3-9-4', True, '增减值_=评估金额_-_账面金额_'),
            ('表3-9-4', True, '增值率_=增减值_/_账面金额_'),

            ('表3-9-5', False, '实际数量_=_账面数量_'),
            ('表3-9-5', False, '评估单价_=_账面单价_'),
            ('表3-9-5', False, '_账面金额_=_账面数量_*_账面单价_'),
            ('表3-9-5', False, '评估金额_=实际数量_*评估单价_'),
            ('表3-9-5', True, '增减值_=评估金额_-_账面金额_'),
            ('表3-9-5', True, '增值率_=增减值_/_账面金额_'),

            ('表3-9-6', False, '实际数量_=_账面数量_'),
            ('表3-9-6', False, '评估单价_=_账面单价_'),
            ('表3-9-6', False, '_账面金额_=_账面数量_*_账面单价_'),
            ('表3-9-6', False, '评估金额_=实际数量_*评估单价_'),
            ('表3-9-6', True, '增减值_=评估金额_-_账面金额_'),
            ('表3-9-6', True, '增值率_=增减值_/_账面金额_'),

            ('表3-9-7', False, '实际数量_=_账面数量_'),
            ('表3-9-7', False, '评估单价_=_账面单价_'),
            ('表3-9-7', False, '_账面金额_=_账面数量_*_账面单价_'),
            ('表3-9-7', False, '评估金额_=实际数量_*评估单价_'),
            ('表3-9-7', True, '增减值_=评估金额_-_账面金额_'),
            ('表3-9-7', True, '增值率_=增减值_/_账面金额_'),

            ('表3-9-8', False, '实际数量_=_账面数量_'),
            ('表3-9-8', False, '评估原价_=_原始入账价值_'),
            ('表3-9-8', False, '评估金额_=评估原价_*成新率_'),
            ('表3-9-8', True, '增减值_=评估金额_-_账面金额_'),
            ('表3-9-8', True, '增值率_=增减值_/_账面金额_'),

            ('表3-10', False, '评估价值_=_账面价值_'),
            ('表3-10', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-10', True, '增值率_=增减值_/_账面价值_'),

            ('表3-11', False, '评估价值_=_账面价值_'),
            ('表3-11', True, '增减值_=评估价值_-_账面价值_'),
            ('表3-11', True, '增值率_=增减值_/_账面价值_'),

            ('表4-1-1', False, '评估价值_=_账面价值_'),
            ('表4-1-1', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-1-1', True, '增值率_=增减值_/_账面价值_'),

            ('表4-1-2', False, '评估价值_=_账面价值_'),
            ('表4-1-2', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-1-2', True, '增值率_=增减值_/_账面价值_'),

            ('表4-1-3', False, '评估价值_=_账面价值_'),
            ('表4-1-3', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-1-3', True, '增值率_=增减值_/_账面价值_'),

            ('表4-2', False, '评估价值_=_账面价值_'),
            ('表4-2', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-2', True, '增值率_=增减值_/_账面价值_'),

            ('表4-3', False, '评估价值_=_账面价值_'),
            ('表4-3', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-3', True, '增值率_=增减值_/_账面价值_'),

            ('表4-4', False, '评估价值_=_账面价值_'),
            ('表4-4', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-4', True, '增值率_=增减值_/_账面价值_'),

            ('表4-5-1', False, '_账面原值_=_建筑面积_*_成本单价（元/㎡）_'),
            ('表4-5-1', False, '评估净值_=评估原值_*成新率_'),
            ('表4-5-1', False, '评估单价（元/㎡）_=评估净值_/_建筑面积_'),
            ('表4-5-1', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-5-2', False, '评估价值_=_账面价值_'),
            ('表4-5-2', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-5-2', True, '增值率_=增减值_/_账面价值_'),

            ('表4-6-1', False, '_账面原值_=_建筑面积（㎡）_*_成本单价（元/㎡）_'),
            ('表4-6-1', False, '评估净值_=评估原值_*成新率_'),
            ('表4-6-1', False, '评估单价（元/㎡）=评估净值_/_建筑面积（㎡）_'),
            ('表4-6-1', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-6-2', False, '评估净值_=评估原值_*成新率_'),
            ('表4-6-2', False, '评估单价（元/㎡）=评估净值_/_建筑面积（㎡）_'),
            ('表4-6-2', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-6-3', False, '评估净值_=评估原值_*成新率_'),
            ('表4-6-3', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-6-4', False, '_启用日期_=_购置日期_'),
            ('表4-6-4', False, '_购置日期_=_启用日期_'),
            ('表4-6-4', False, '评估净值_=评估原值_*成新率_'),
            ('表4-6-4', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-6-5', False, '_启用日期_=_购置日期_'),
            ('表4-6-5', False, '_购置日期_=_启用日期_'),
            ('表4-6-5', False, '评估净值_=评估原值_*成新率_'),
            ('表4-6-5', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-6-6', False, '_启用日期_=_购置日期_'),
            ('表4-6-6', False, '_购置日期_=_启用日期_'),
            ('表4-6-6', False, '评估净值_=评估原值_*成新率_'),
            ('表4-6-6', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-6-7', False, '评估价值_=_账面价值_'),
            ('表4-6-7', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-6-7', True, '增值率_=增减值_/_账面价值_'),

            ('表4-7-1', False, '评估价值_=_账面价值_'),
            ('表4-7-1', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-7-1', True, '增值率_=增减值_/_账面价值_'),

            ('表4-7-2', False, '_合计_=_设备费_+_资金成本_+_安装费及其他_'),
            ('表4-7-2', False, '评估合计_=评估设备费_+评估资金成本_+评估安装及其他_'),
            ('表4-7-2', True, '增减值_=评估合计_-_合计_'),
            ('表4-7-2', True, '增值率_=增减值_/_合计_'),

            ('表4-8', False, '实际数量_=_账面数量_'),
            ('表4-8', False, '评估单价_=_账面单价_'),
            ('表4-8', False, '_账面金额_=_账面数量_*_账面单价_'),
            ('表4-8', False, '评估金额_=实际数量_*评估单价_'),
            ('表4-8', True, '增减值_=评估金额_-_账面金额_'),
            ('表4-8', True, '增值率_=增减值_/_账面金额_'),

            ('表4-9', False, '评估价值_=_账面价值_'),
            ('表4-9', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-9', True, '增值率_=增减值_/_账面价值_'),

            ('表4-10', False, '评估净值_=评估原值_*成新率_'),
            ('表4-10', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-11', False, '评估净值_=评估原值_*成新率_'),
            ('表4-11', True, '增值率_=(评估净值_-_账面净值_)/_账面净值_'),

            ('表4-12-1', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-12-1', True, '增值率_=增减值_/_账面价值_'),

            ('表4-12-2', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-12-2', True, '增值率_=增减值_/_账面价值_'),

            ('表4-12-3', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-12-3', True, '增值率_=增减值_/_账面价值_'),

            ('表4-13', False, '评估价值_=_账面价值_'),
            ('表4-13', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-13', True, '增值率_=增减值_/_账面价值_'),

            ('表4-14', False, '评估价值_=_账面价值_'),
            ('表4-14', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-14', True, '增值率_=增减值_/_账面价值_'),

            ('表4-15', False, '评估价值_=_账面价值_'),
            ('表4-15', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-15', True, '增值率_=增减值_/_账面价值_'),

            ('表4-16', False, '评估价值_=_账面价值_'),

            ('表4-17', False, '评估价值_=_账面价值_'),
            ('表4-17', True, '增减值_=评估价值_-_账面价值_'),
            ('表4-17', True, '增值率_=增减值_/_账面价值_'),

            ('表5-1', False, '评估价值_=_账面价值_'),
            ('表5-1', False, '评估价值_=_外币金额_*外币基准日汇率_'),

            ('表5-2', False, '评估价值_=_账面价值_'),
            ('表5-3', False, '评估价值_=_账面价值_'),
            ('表5-4', False, '评估价值_=_账面价值_'),
            ('表5-5', False, '评估价值_=_账面价值_'),
            ('表5-6', False, '评估价值_=_账面价值_'),
            ('表5-7', False, '评估价值_=_账面价值_'),
            ('表5-8', False, '评估价值_=_账面价值_'),
            ('表5-9', False, '评估价值_=_账面价值_'),
            ('表5-10', False, '评估价值_=_账面价值_'),
            ('表5-11', False, '评估价值_=_账面价值_'),
            ('表5-12', False, '评估价值_=_账面价值_'),

            ('表6-1', False, '评估价值_=_账面价值_'),
            ('表6-1', False, '评估价值_=_外币金额_*外币基准日汇率_'),

            ('表6-2', False, '评估价值_=_账面价值_'),

            ('表6-3', True, '_账面价值合计_=_账面价值初额_-_账面价值利息及汇率净损失_'),
            ('表6-3', False, '评估价值_=_账面价值合计_'),

            ('表6-4', False, '评估价值_=_账面价值_'),
            ('表6-5', False, '评估价值_=_账面价值_'),
            ('表6-6', False, '评估价值_=_账面价值_'),
            ('表6-7', False, '评估价值_=_账面价值_'),

            ('表7', True, '增减值_=评估价值_-_账面价值_'),
            ('表7', True, '增值率_=增减值_/_账面价值_'),

            ('表7r', True, '实收资本净额（或股本）=实收资本（或股本）-　减：已归还投资'),
            ('表7r', True, '所有者权益（净资产）合计=实收资本净额（或股本）+资本公积+盈余公积+未分配利润（未弥补亏损以“-”号表示）'),

            ('表8', True, '增减值_=评估价值_-_账面价值_'),
            ('表8', True, '增值率_=增减值_/_账面价值_'),

            ('表8r', True, '一、应收坏账准备合计=　　其中：应收票据+　　　　　应收账款+　　　　　预付账款+　　　　　其他应收款'),
            ('表8r', True, '三、可供出售金融资产减值准备合计=　　其中：可供出售股票+　　　　　可供出售债券+　　　　　可供出售其他资产'),
            ('表8r', True, '七、投资性房地产减值准备合计=　　其中：房屋+　　　　　土地使用权'),
            ('表8r', True, '八、固定资产减值准备合计=　　其中：房屋、建筑物+　　　　　构筑物及其他辅助设施+　　　　　管道和沟槽+　　　　　机器设备+　　　　　车辆+　　　　　电子设备'),
            ('表8r', True, '九、在建工程减值准备合计=　　其中：在建土建工程+　　　　　在建设备安装'),
            ('表8r', True, '资产减值合计=一、应收坏账准备合计+二、存货跌价准备+三、可供出售金融资产减值准备合计+四、持有至到期投资减值准备+五、长期应收款减值准备+六、长期股权投资减值准备+七、投资性房地产减值准备合计+八、固定资产减值准备合计+九、在建工程减值准备合计+十、工程物质减值准备+十一、生产性生物资产减值准备+十二、油气资产减值准备+十三、无形资产减值准备+十四、商誉减值准备'),
        ]
    ]
}
