#!/usr/bin/env python
# -*- coding: utf-8 -*-

ASSET_INSERT = {
    '表7': [
        '[_资产名称_]', [
            ('实收资本（或股本）',),
            ('  减：已归还投资',),
            ('实收资本净额（或股本）',),
            ('资本公积',),
            ('  其中：库存股',),
            ('盈余公积',),
            ('  其中：法定公益金',),
            ('未分配利润（未弥补亏损以“-”号表示）',),
            ('所有者权益（净资产）合计',)
        ]
    ],
    '表8': [
        '[_科目名称_]', [
            ('一、应收坏账准备合计',),
            ('    其中：应收票据',),
            ('          应收帐款',),
            ('          预付帐款',),
            ('          其他应收款',),
            ('二、存货跌价准备',),
            ('三、可供出售金融资产减值准备合计',),
            ('    其中：可供出售股票',),
            ('          可供出售债券',),
            ('          可供出售其他资产',),
            ('四、持有至到期投资减值准备',),
            ('五、长期应收款减值准备',),
            ('六、长期股权投资减值准备',),
            ('七、投资性房地产减值准备合计',),
            ('    其中：房屋',),
            ('          土地使用权',),
            ('八、固定资产减值准备合计',),
            ('    其中：房屋、建筑物',),
            ('          构筑物及其他辅助设施',),
            ('          管道和沟槽',),
            ('          机器设备',),
            ('          车辆',),
            ('          电子设备',),
            ('九、在建工程减值准备合计',),
            ('    其中：在建土建工程',),
            ('          在建设备安装',),
            ('十、工程物质减值准备',),
            ('十一、生产性生物资产减值准备',),
            ('十二、油气资产减值准备',),
            ('十三、无形资产减值准备',),
            ('十四、商誉减值准备',),
            ('资产减值合计',)
        ]
    ]
}
