#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
用来设置默认新建表的设定
列名设置可通过前后下划线来规划属于哪级导出表
前有_       为清查上报表使用列
后有_       为评估明细表使用列
前后都无    为评估工作底稿使用列
数据类型：
Nchar       为unicode字符，括号内为字长，用于文本
Int         为整数，显示时不带小数，用于整数数量
Real        为浮点数，显示时保留2位小数，用于金额
Rate        为浮点数，显示时保留4位小数，用于汇率和数量单价等
Percent     为浮点数，显示时为带百分号的百分数，用于百分比
Date        为日期字符串，显示时保持YYYY-MM-DD形式，主动调用日期控件编辑
Bool        为布尔值，显示时为单选框，用于2项的单选
Switch      为整数，显示时为单选框，用于2项以上的单选
"""

BASIC_TABLE = {
    '基础信息表': {
        '项目编号': 'Nchar(10)',
        '评估基准日': 'Date',
        '项目文号': 'Nchar(20)',
        '项目全称': 'Nchar(100)',
    },
    '公式': {
        '表名': 'Nchar(10)',
        '强制': 'Bool',
        '等式': 'Nchar(100)',
    },
}

ASSET_TABLE = {
    '表3-1-1': {
        '_存放部门（单位）_': 'Nchar(40)',
        '_币种_': 'Nchar(10)',
        '_外币账面金额_': 'Real',
        '_评估基准日汇率_': 'Rate',
        '_账面价值_': 'Real',
        '盘点金额': 'Real',
        '盘点人员': 'Nchar(15)',
        '盘点日期': 'Date',
        '评估价值_': 'Real',
        '增减值_': 'Real',
        '增值率_': 'Percent',
        '_备注_': 'Nchar(20)'
    },
    '表3-1-2': {
        '_开户银行_': 'Nchar(40)',
        '_账号_': 'Nchar(30)',
        '_币种_': 'Nchar(10)',
        '_外币账面金额_': 'Real',
        '_评估基准日汇率_': 'Rate',
        '_账面价值_': 'Real',
        '对账单金额': 'Real',
        '对账单索引号': 'Nchar(30)',
        '是否经函证': 'Bool',
        '评估价值_': 'Real',
        '增减值_': 'Real',
        '增值率_': 'Percent',
        '_备注_': 'Nchar(20)'
    },
    '表3-1-3': {
        '_名称或内容_': 'Nchar(40)',
        '_用途_': 'Nchar(30)',
        '_账号_': 'Nchar(30)',
        '_币种_': 'Nchar(10)',
        '_外币账面金额_': 'Real',
        '_评估基准日汇率_': 'Rate',
        '_账面价值_': 'Real',
        '对账单金额': 'Real',
        '对账单索引号': 'Nchar(30)',
        '是否经函证': 'Bool',
        '评估价值_': 'Real',
        '增减值_': 'Real',
        '增值率_': 'Percent',
        '_备注_': 'Nchar(20)'
    },
    '表3-2-1': {

    },
    '表3-2-2': {

    },
    '表3-2-3': {

    },
    '表3-3': {

    },
    '表3-4': {

    },
    '表3-5': {

    },
    '表3-6': {

    },
    '表3-7': {

    },
    '表3-8': {

    },
    '表3-9-1': {

    },
    '表3-9-2': {

    },
    '表3-9-3': {

    },
    '表3-9-4': {

    },
    '表3-9-5': {

    },
    '表3-9-6': {

    },
    '表3-9-7': {

    },
    '表3-9-8': {

    },
    '表3-10': {

    },
    '表3-11': {

    },
    '表4-1-1': {

    },
    '表4-1-2': {

    },
    '表4-1-3': {

    },
    '表4-2': {

    },
    '表4-3': {

    },
    '表4-4': {

    },
    '表4-5-1': {

    },
    '表4-5-2': {

    },
    '表4-6-1': {

    },
    '表4-6-2': {

    },
    '表4-6-3': {

    },
    '表4-6-4': {

    },
    '表4-6-5': {

    },
    '表4-6-6': {

    },
    '表4-6-7': {

    },
    '表4-7-1': {

    },
    '表4-7-2': {

    },
    '表4-8': {

    },
    '表4-9': {

    },
    '表4-10': {

    },
    '表4-11': {

    },
    '表4-12-1': {

    },
    '表4-12-2': {

    },
    '表4-12-3': {

    },
    '表4-13': {

    },
    '表4-14': {

    },
    '表4-15': {

    },
    '表4-16': {

    },
    '表4-17': {

    },
    '表5-1': {

    },
    '表5-2': {

    },
    '表5-3': {

    },
    '表5-4': {

    },
    '表5-5': {

    },
    '表5-6': {

    },
    '表5-7': {

    },
    '表5-8': {

    },
    '表5-9': {

    },
    '表5-10': {

    },
    '表5-11': {

    },
    '表5-12': {

    },
    '表6-1': {

    },
    '表6-2': {

    },
    '表6-3': {

    },
    '表6-4': {

    },
    '表6-5': {

    },
    '表6-6': {

    },
    '表6-7': {

    },
    '表7': {

    },
    '表8': {

    },
}


DRAFT_TABLE = {

}