#!/usr/bin/env python
# -*- coding: utf-8 -*-

SUMMARY_VIEW = {
    '表3-1': '''CREATE VIEW [表3-1-TEMP] AS
                SELECT "3-1-1" AS [_编号_],
                       "现金" AS [_科目名称_],
                       sum([_账面价值_]) AS [_账面价值_],
                       sum([评估价值_]) AS [评估价值_],
                       sum([评估价值_]) - sum([_账面价值_]) AS [增减值_],
                       (sum([评估价值_]) - sum([_账面价值_]))/sum([_账面价值_]) AS [增值率_]
                FROM [表3-1-1]
                UNION ALL
                SELECT "3-1-2" AS [_编号_],
                       "银行存款" AS [_科目名称_],
                       sum([_账面价值_]) AS [_账面价值_],
                       sum([评估价值_]) AS [评估价值_],
                       sum([评估价值_]) - sum([_账面价值_]) AS [增减值_],
                       (sum([评估价值_]) - sum([_账面价值_]))/sum([_账面价值_]) AS [增值率_]
                FROM [表3-1-2]
                UNION ALL
                SELECT "3-1-3" AS [_编号_],
                       "其他货币资金" AS [_科目名称_],
                       sum([_账面价值_]) AS [_账面价值_],
                       sum([评估价值_]) AS [评估价值_],
                       sum([评估价值_]) - sum([_账面价值_]) AS [增减值_],
                       (sum([评估价值_]) - sum([_账面价值_]))/sum([_账面价值_]) AS [增值率_]
                FROM [表3-1-3];''',
    '表3-1 ': '''CREATE VIEW [表3-1] AS
                 SELECT [_编号_], [_科目名称_], [_账面价值_], [评估价值_], [增减值_], [增值率_]
                 FROM [表3-1-TEMP]
                 UNION ALL
                 SELECT "3-1" AS [_编号_],
                       "货币资金合计" AS [_科目名称_],
                       sum([_账面价值_]) AS [_账面价值_],
                       sum([评估价值_]) AS [评估价值_],
                       sum([评估价值_]) - sum([_账面价值_]) AS [增减值_],
                       (sum([评估价值_]) - sum([_账面价值_]))/sum([_账面价值_]) AS [增值率_]
                FROM [表3-1-TEMP];''',

}
